Autodesk.Revit.DB.ParameterDownloadOptions.SetGroupTypeId(Autodesk.Revit.DB.ForgeTypeId)
Set properties palette group identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions.GetGroupTypeId
Get properties palette group identifier.
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions.SetCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set categories for binding.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions.GetCategories
Get categories for binding.
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ParameterDownloadOptions.Visible
True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions.IsInstance
True if binding to Element instances, false if binding to Element types.
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions.#ctor(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Boolean,System.Boolean,Autodesk.Revit.DB.ForgeTypeId)
Creates a new ParameterDownloadOptions instance.
Category bindings are represented by an ElementIdSet populated with category identifiers.
categories:
The category identifiers.
isInstance:
True if binding to Element instances, false if binding to Element types.
visible:
True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
groupTypeId:
Properties palette group identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions.#ctor
Default constructor.
Since:
2024

Autodesk.Revit.DB.ParameterDownloadOptions
An option class used for downloading parameters from the Parameters Service.
Since:
2024